# Quiz 1

다음 조건을 만족하는 코드를 작성하시오.

- 리스트 a = [1, 2, 3] 과 t1 = (1, 2, 3) 을 각각 복사하여 b, t2 에 저장한다.
- 각 변수에 += [4], += (4,) 를 수행한다.
- 이후 a, b, t1, t2 의 값을 출력하고, is 연산자를 이용해 같은 객체인지 확인하시오.

리스트와 튜플의 동작 차이를 설명하시오.


# Quiz 2

정수 리스트 nums = [12, -3, 7, 0, -8, 15] 가 있다.
양수는 "P", 0은 "Z", 음수는 "N" 으로 변환하는 새 리스트 status 를 만들어라.
list comprehension 을 사용하시오.

결과 예시: ['P', 'N', 'P', 'Z', 'N', 'P']


# Quiz 3

문자열 text = "DataScience" 가 주어졌을 때, 문자열에서 "Science" 부분을 "AI" 로 교체하여 "DataAI" 를 만들고 최종 결과를 모두 대문자로 변환한다.

슬라이싱과 문자열 결합, 문자열 메서드를 활용하시오.


# Quiz 4

정수 year 를 입력받아 윤년인지 판별하는 코드를 작성하시오.

조건: 4의 배수이면서, (100의 배수가 아니거나 400의 배수이면) 윤년 / 그 외는 평년

출력 예시: 2024년은 윤년입니다. 또는 2023년은 평년입니다.


# Quiz 5

2차원 리스트 matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]] 에서 홀수만 추출하여 새 리스트 odds 에 저장하시오.

결과 예시: [1, 3, 5, 7, 9]

리스트 내포와 조건 필터링을 사용하시오.
